espressif/esp-idf/components/soc/esp32h4/register/soc/mcpwm_reg.h
/** MCPWM_OP0_TSTMP_E2_REG register
 *  Generator0 timer stamp E2 value register
 */
#define MCPWM_OP0_TSTMP_E2_REG(i) (DR_REG_MCPWM_BASE(i) + 0x12c)
/** MCPWM_OP0_TSTMP_E2 : R/W; bitpos: [15:0]; default: 0;
 *  Configures generator0 timer stamp E2 value register
 */
#define MCPWM_OP0_TSTMP_E2    0x0000FFFFU
#define MCPWM_OP0_TSTMP_E2_M  (MCPWM_OP0_TSTMP_E2_V << MCPWM_OP0_TSTMP_E2_S)
#define MCPWM_OP0_TSTMP_E2_V  0x0000FFFFU
#define MCPWM_OP0_TSTMP_E2_S  0

/** MCPWM_OP1_TSTMP_E1_REG register
 *  Generator1 timer stamp E1 value register
 */
#define MCPWM_OP1_TSTMP_E1_REG(i) (DR_REG_MCPWM_BASE(i) + 0x130)
/** MCPWM_OP1_TSTMP_E1 : R/W; bitpos: [15:0]; default: 0;
 *  Configures generator1 timer stamp E1 value register
 */
#define MCPWM_OP1_TSTMP_E1    0x0000FFFFU
#define MCPWM_OP1_TSTMP_E1_M  (MCPWM_OP1_TSTMP_E1_V << MCPWM_OP1_TSTMP_E1_S)
#define MCPWM_OP1_TSTMP_E1_V  0x0000FFFFU
#define MCPWM_OP1_TSTMP_E1_S  0

/** MCPWM_OP1_TSTMP_E2_REG register
 *  Generator1 timer stamp E2 value register
 */
#define MCPWM_OP1_TSTMP_E2_REG(i) (DR_REG_MCPWM_BASE(i) + 0x134)
/** MCPWM_OP1_TSTMP_E2 : R/W; bitpos: [15:0]; default: 0;
 *  Configures generator1 timer stamp E2 value register
 */
#define MCPWM_OP1_TSTMP_E2    0x0000FFFFU
#define MCPWM_OP1_TSTMP_E2_M  (MCPWM_OP1_TSTMP_E2_V << MCPWM_OP1_TSTMP_E2_S)
#define MCPWM_OP1_TSTMP_E2_V  0x0000FFFFU
#define MCPWM_OP1_TSTMP_E2_S  0

/** MCPWM_OP2_TSTMP_E1_REG register
 *  Generator2 timer stamp E1 value register
 */
#define MCPWM_OP2_TSTMP_E1_REG(i) (DR_REG_MCPWM_BASE(i) + 0x138)
/** MCPWM_OP2_TSTMP_E1 : R/W; bitpos: [15:0]; default: 0;
 *  Configures generator2 timer stamp E1 value register
 */
#define MCPWM_OP2_TSTMP_E1    0x0000FFFFU
#define MCPWM_OP2_TSTMP_E1_M  (MCPWM_OP2_TSTMP_E1_V << MCPWM_OP2_TSTMP_E1_S)
#define MCPWM_OP2_TSTMP_E1_V  0x0000FFFFU
#define MCPWM_OP2_TSTMP_E1_S  0

/** MCPWM_OP2_TSTMP_E2_REG register
 *  Generator2 timer stamp E2 value register
 */
#define MCPWM_OP2_TSTMP_E2_REG(i) (DR_REG_MCPWM_BASE(i) + 0x13c)
/** MCPWM_OP2_TSTMP_E2 : R/W; bitpos: [15:0]; default: 0;
 *  Configures generator2 timer stamp E2 value register
 */
#define MCPWM_OP2_TSTMP_E2    0x0000FFFFU
#define MCPWM_OP2_TSTMP_E2_M  (MCPWM_OP2_TSTMP_E2_V << MCPWM_OP2_TSTMP_E2_S)
#define MCPWM_OP2_TSTMP_E2_V  0x0000FFFFU
#define MCPWM_OP2_TSTMP_E2_S  0

/** MCPWM_CLK_REG register
 *  Global configuration register
 */
#define MCPWM_CLK_REG(i) (DR_REG_MCPWM_BASE(i) + 0x140)
/** MCPWM_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether or not to open register clock gate.
 *  0: Open the clock gate only when application writes registers
 *  1: Force open the clock gate for register
 */
#define MCPWM_CLK_EN    (BIT(0))
#define MCPWM_CLK_EN_M  (MCPWM_CLK_EN_V << MCPWM_CLK_EN_S)
#define MCPWM_CLK_EN_V  0x00000001U
#define MCPWM_CLK_EN_S  0

/** MCPWM_VERSION_REG register
 *  Version register.
 */
#define MCPWM_VERSION_REG(i) (DR_REG_MCPWM_BASE(i) + 0x144)
/** MCPWM_DATE : R/W; bitpos: [27:0]; default: 37761424;
 *  Configures the version.
 */
#define MCPWM_DATE    0x0FFFFFFFU
#define MCPWM_DATE_M  (MCPWM_DATE_V << MCPWM_DATE_S)
#define MCPWM_DATE_V  0x0FFFFFFFU
#define MCPWM_DATE_S  0

#ifdef __cplusplus
}
#endif
